Revit 2027 API
ViewShapeBuilder.ViewNormal Property
 Normal of the view that will display the shape being built. Must be set explicitly before adding any geometry. Must be a unit vector. This is used to validate incoming geometry - it must be orthogonal to the viewNormal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ViewNormal { get; set; }
Public Property ViewNormal As XYZ
	Get
	Set
public:
property XYZ^ ViewNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
member ViewNormal : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: viewNormal is not length 1.0.
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace